'use client';

const PrivacyPolicyPage = () => {
  return (
    <div className="bg-gray-50 py-12 px-4 sm:px-6 lg:px-8">
      <div className="max-w-3xl mx-auto bg-white p-8 rounded-lg shadow-md">
        <h1 className="text-3xl font-bold text-gray-900 mb-6">Политика конфиденциальности</h1>
        
        <div className="space-y-6 text-gray-700">
          <p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт, расположенный на доменном имени www.helpmame.ru, может получить о Пользователе во время использования сайта.</p>

          <h2 className="text-2xl font-semibold text-gray-800">1. Определение терминов</h2>
          <p>1.1. В настоящей Политике конфиденциальности используются следующие термины:</p>
          <ul className="list-disc list-inside space-y-2 pl-4">
            <li><strong>«Администрация сайта»</strong> – уполномоченные сотрудники на управление сайтом, действующие от его имени, которые организуют и (или) осуществляют обработку персональных данных.</li>
            <li><strong>«Персональные данные»</strong> - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</li>
            <li><strong>«Обработка персональных данных»</strong> - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными.</li>
            <li><strong>«Конфиденциальность персональных данных»</strong> - обязательное для соблюдения Администрацией сайта требование не допускать их умышленного распространения без согласия субъекта персональных данных или наличия иного законного основания.</li>
            <li><strong>«Пользователь сайта (далее - Пользователь)»</strong> – лицо, имеющее доступ к сайту, посредством сети Интернет и использующее данный сайт для своих целей.</li>
          </ul>

          <h2 className="text-2xl font-semibold text-gray-800">2. Общие положения</h2>
          <p>2.1. Использование Пользователем сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>
          <p>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта.</p>

          <h2 className="text-2xl font-semibold text-gray-800">3. Предмет политики конфиденциальности</h2>
          <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по умышленному неразглашению персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при заполнении форм на сайте.</p>
          <p>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на Сайте и включают в себя следующую информацию: ФИО, номер телефона, описание вопроса.</p>

          <h2 className="text-2xl font-semibold text-gray-800">4. Цели сбора персональной информации пользователя</h2>
          <p>4.1. Персональные данные Пользователя Администрация сайта может использовать в целях:</p>
          <ul className="list-disc list-inside space-y-2 pl-4">
            <li>Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг, обработка запросов и заявок от Пользователя.</li>
            <li>Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта.</li>
          </ul>

          <h2 className="text-2xl font-semibold text-gray-800">5. Способы и сроки обработки персональной информации</h2>
          <p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>

          <h2 className="text-2xl font-semibold text-gray-800">6. Обязательства сторон</h2>
          <p>6.1. Пользователь обязуется:</p>
          <ul className="list-disc list-inside space-y-2 pl-4">
              <li>Предоставить корректную информацию о персональных данных, необходимую для пользования Сайтом.</li>
          </ul>
          <p>6.2. Администрация сайта обязуется:</p>
          <ul className="list-disc list-inside space-y-2 pl-4">
              <li>Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</li>
              <li>Обеспечить хранение конфиденциальной информации в тайне.</li>
          </ul>

          <h2 className="text-2xl font-semibold text-gray-800">7. Дополнительные условия</h2>
          <p>7.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
          <p>7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>

        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicyPage;
